"""Функция filter_by_state , принимает список словарей и опционально
   значение ключа state (по умолчанию 'EXECUTED'. Возвращает новый список
   словарей, содержащий только те словари, у которых ключ state соответствует
   указаному значению"""


def filter_by_state(liste_dict: str, state_1: str) -> str:
    pass


"""Функция sort_by_date ,принимает список словарей и необязательный параметр, 
   задающий порядок сортировки (по умолчанию-убывание). Функция возвращает новый 
   список, отсортированный подате """


def sort_by_date(liste_dict: str, date_1: str) -> str:
    pass